export const apiEmail = 'evstratenko.sv98@gmail.com';
export const apiPassword = 'Stanislav010101';
export const apiUrl = 'http://localhost:1337/api';
export const apiToken =
  '0892be7339526582994da0f589885a8afcc370519cd50dbdcb54907121e90be737c643c0300dc2598d849a4c09fcdb8846dd9db73b2c26a85854e29ba6c786a08fae766efbc7101102aa026a753ff12cbfaf9c2f0482df0c8c1adb80d461e6a218439bebb751ed19593bdb87e478192e568b70c961f0f1e56c908bb615b655b2';

export const menu = [
  {
    title: 'Услуги',
    link: '/'
  },
  {
    title: 'Проекты',
    link: '/'
  },
  {
    title: 'Компания',
    link: '/'
  },
  {
    title: 'Работа',
    link: '/'
  },
  {
    title: 'Знания',
    link: '/'
  },
  {
    title: 'Контакты',
    link: '/'
  }
];

// export const promoTeam = ['/photo_1.png', '/photo_2.png', '/photo_3.png'];
export const promoTeam = ['/skill_photo_1.png', '/skill_photo_2.png', '/skill_photo_3.png'];

export const skillTeam = [
  '/skill_photo_1.png',
  '/skill_photo_2.png',
  '/skill_photo_3.png',
  '/skill_photo_4.png'
];

export const activity = [
  {
    title: 'Разработка',
    categories: [
      'Мобильные приложения',
      'Web-cервисы',
      'MVP стартапы',
      'ERP-системы',
      'Desktop приложения'
    ],
    tabs: ['Time&material', 'Agile']
  },
  {
    title: 'Аутстафф',
    categories: ['Frontend', 'Backend', 'UI/UX Дизайнер'],
    tabs: ['Middle', 'Senior']
  },
  {
    title: `Аналитика и\u00A0поддержка`,
    categories: [
      `Аналитика и\u00A0документация`,
      `Внедрения и\u00A0интеграции`,
      'IT-консалтинг',
      'Техническая поддержка'
    ],
    tabs: ['Решения', 'Документация']
  }
];

export const projects = [
  {
    id: 1,
    photo: '/project1.jpg',
    text: 'Мобильное приложение для\u00A0электротехнического холдинга Таврида Электрик',
    tags: ['Инженерные технологии ']
  },
  {
    id: 2,
    photo: '/project2.jpg',
    text: 'CRM-система и\u00A0сайт Live boosts по\u00A0продаже услуг в\u00A0онлайн-играх',
    tags: ['Игры', 'Стартапы']
  },
  {
    id: 3,
    photo: '/project3.jpg',
    text: 'UI/UX дизайн мобильного приложения для\u00A0собаководов Go\u00A0Dog',
    tags: ['Стартапы']
  },
  {
    id: 4,
    photo: '/project4.jpg',
    text: 'Браузерная игра и\u00A0web-сервис Место Встречи для\u00A0обучения студентов',
    tags: ['Игры', 'Образование']
  }
];

export const accordios = [
  {
    id: 1,
    title: 'Что нужно, чтобы начать разработку проекта?',
    text: 'От вас нужно личное понимание целей и задач своего продукта. Подготовьте либо техническое задание, либо первичное описание. В зависимости от этого по-разному работаем. Опишите с помощью технических специалистов или своими словами максимум функциональных задач создаваемого продукта. Это может быть: назначение, сценарий работы, платформы, интерфейс, обмен данными, технические требования. А также первым этапом, мы можем совместно с заказчиком начать составление техзадания.'
  },
  {
    id: 2,
    title: 'Сможем ли мы самостоятельно поддерживать ПО своим штатом сотрудников?',
    text: 'В разработке мы придерживаемся стандартов программного кода, его архитектуры и комментирования. Поэтому, вы сможете поддерживать самостоятельно при наличии квалифицированных специалистов соответствующего технологического стека на вашей сторон'
  },
  {
    id: 3,
    title: 'Что делать, если после запуска будут появляться ошибки?',
    text: 'Если это программные недостатки, которые были заложены в техзадании, но изначально не выявлены в процессе тестирования — то гарантия на разработку распространяется. Устраняем без дополнительной платы. Негарантийные случаи — это доработки, серверные ошибки, изменения программы сторонними лицами. Например, если функционал не был заложен в техзадании и выяснилось что он нужен. Если ошибки вызваны внесением изменений в программный продукт других специалистов. Или если сервер, на котором заказчик разместил программный продукт, по характеристикам не вытягивает то количество пользователей, которое посещает веб-сервис. Ошибка не программная, а вызвана серверной инфраструктурой.'
  },
  {
    id: 4,
    title: 'Как понять сроки на создание проекта?',
    text: 'Если в создании сайта можно говорить о средних сроках, то в заказной разработке нет. Сроки зависят от требований к функционалу, сформированного технического задания, оценки проекта и затраченных человеко-часов. Минимальный срок на разработку MVP стартапа, мобильного приложения — 6 месяцев.'
  }
];

export const menuList = [
  {
    id: 1,
    title: 'Меню',
    categories: [
      {
        id: 11,
        title: 'Услуги',
        href: '/'
      },
      {
        id: 12,
        title: 'Проекты',
        href: '/'
      },
      {
        id: 13,
        title: 'Компания',
        href: '/'
      },
      {
        id: 14,
        title: 'Работа',
        href: '/'
      },
      {
        id: 15,
        title: 'Знания',
        href: '/'
      },
      {
        id: 16,
        title: 'Контакты',
        href: '/'
      }
    ]
  },
  {
    id: 2,
    title: 'Разработка',
    categories: [
      {
        id: 21,
        title: 'Мобильные приложения',
        href: '/'
      },
      {
        id: 22,
        title: 'Web-cервисы',
        href: '/'
      },
      {
        id: 23,
        title: 'MVP\u00A0стартапов',
        href: '/'
      },
      {
        id: 24,
        title: 'ERP-системы',
        href: '/'
      },
      {
        id: 25,
        title: 'Desktop приложения',
        href: '/'
      }
    ]
  },
  {
    id: 3,
    title: 'Аутстафф',
    categories: [
      {
        id: 31,
        title: 'Front\u00A0end',
        href: '/'
      },
      {
        id: 32,
        title: 'Back\u00A0end',
        href: '/'
      },
      {
        id: 33,
        title: 'UI/UX Дизайнер',
        href: '/'
      }
    ]
  },
  {
    id: 4,
    title: 'Аналитика и\u00A0поддержка',
    categories: [
      {
        id: 41,
        title: 'Аналитика и\u00A0документация',
        href: '/'
      },
      {
        id: 42,
        title: 'Внедрения и\u00A0интеграции',
        href: '/'
      },
      {
        id: 43,
        title: 'IT-консалтинг',
        href: '/'
      },
      {
        id: 44,
        title: 'Техническая поддержка',
        href: '/'
      }
    ]
  }
];

export const experience = [
  {
    id: '1',
    title: 'Инженерные технологии'
  },
  {
    id: '2',
    title: 'Промышленность'
  },
  {
    id: '3',
    title: 'Стартапы'
  },
  {
    id: '4',
    title: 'Игры'
  },
  {
    id: '5',
    title: 'Образование'
  },
  {
    id: '6',
    title: 'Финансы'
  },
  {
    id: '7',
    title: 'Документооборот'
  },
  {
    id: '8',
    title: 'Телекоммуникации'
  },
  {
    id: '9',
    title: 'Недвижимость'
  },
  {
    id: '10',
    title: 'E-commerce'
  }
];

export const fakeMessages = [
  {
    isCustomer: false,
    messageText: `Здравствуйте, какой вопрос вас интересует?`,
    avatar: '/msg_avatar.png'
  },
  {
    isCustomer: false,
    messageText: `Напишите свой номер телефона, мы перезвоним вам в ближайшее время. 
    Обращаю ваше внимание, что отправляя номер вы соглашаетесь`,
    link: {
      text: `с политикой конфиденциальности`,
      url: 'http://localhost:3000/politic'
    },
    avatar: '/msg_avatar.png'
  },
  {
    isCustomer: false,
    messageText: `Спасибо! До встречи.`,
    avatar: '/msg_avatar.png'
  }
];

export const chatQuestions = [
  {
    id: 1,
    question: `Приветствуем! Про какую услугу вы хотели бы узнать подробнее?`,
    tags: [
      { title: 'мобильное приложение' },
      { title: 'web-сервис' },
      { title: 'mvp стартап' },
      { title: 'erp-система' },
      { title: 'аутсорс' },
      { title: 'аутстафф' },
      { title: 'интеграции' },
      { title: 'техподдержка' }
    ]
  },

  {
    id: 2,
    question: `Какое направление деятельности вашей компании?`,
    tags: [
      { title: 'промышленность' },
      { title: 'e-commerce' },
      { title: 'инженерные технологии' },
      { title: 'образование' },
      { title: 'телеком' },
      { title: 'финансы' },
      { title: 'игры' }
    ]
  },
  {
    id: 3,
    question: `Опишите цели и задачи, которые планируете достичь?`,
    tags: [
      { title: 'Автоматизация производства' },
      { title: 'Информирование клиентов' },
      { title: 'Автоматизация труда' },
      { title: 'Обучение персонала' },
      { title: 'Оптимизация логистики' }
    ]
  },
  {
    id: 4,
    question: `Желаемые сроки работ?`,
    tags: [
      { title: '1-3 месяца' },
      { title: '3-6 месяцев' },
      { title: 'до 1 года' },
      { title: 'свыше 1 года' }
    ]
  },
  {
    id: 5,
    question: `Напишите название компании, имя, телефон и электронную почту. Обращаю ваше внимание, что отправляя данные вы соглашаетесь 
    `,
    link: {
      text: `с политикой конфиденциальности`,
      url: 'http://localhost:3000/politic'
    }
  },
  {
    id: 6,
    question: `Информация принята. Мы вам перезвоним или напишем на указанный e-mail. Спасибо за обращение, хорошего дня!
    `
  }
];

export const servicesCollection = [
  { id: 1, value: 'mobile_app', label: 'Мобильное приложение' },
  { id: 2, value: 'desktop_app', label: 'Desktop приложение' },
  { id: 3, value: 'outstaff', label: 'Аутстаффинг' },
  { id: 4, value: 'web_service', label: 'Web-сервис' },
  { id: 5, value: 'mvp', label: 'MVP стартапа' },
  { id: 6, value: 'erp-system', label: 'ERP-системы' },
  { id: 7, value: 'it-consulting', label: 'IT-консалтинг' },
  { id: 8, value: 'implementation', label: 'Внедрение и интеграция' },
  { id: 9, value: 'analytics', label: 'Аналитика и документация' }
];

export const deadlineCollection = [
  { id: 1, value: 'three_months', label: '1-3 месяца' },
  { id: 2, value: 'six_months', label: 'до 6 месяцев' },
  { id: 3, value: 'year', label: 'до 1 года' }
];

export const budgetCollection = [
  { id: 1, value: '500_thousand', label: 'до 500 тыс.руб' },
  { id: 2, value: '1_million', label: 'до 1 млн руб' },
  { id: 3, value: '3_million', label: 'до 3 млн руб' },
  { id: 4, value: 'more_3_million', label: 'свыше 3 млн руб' }
];

export const functionalDesc = [
  {
    id: 1,
    title: 'Пример ключевых бизнес задач',
    desc: `Ключевыми бизнес-задачами могут быть: повышение клиентской лояльности, увеличение объема продаж, информирование клиентов, повышение эффективности менеджеров, оптимизация процессов логистики, автоматизация документооборота, производства, ручного труда, процесса обучения сотрудников.`
  },
  {
    id: 2,
    title: 'Пример базового функционала',
    desc: `Пример базового функционала: авторизация/регистрация, бонусные программы, работа с\u00A0QR-кодами, комментирование, push-уведомления, новостная лента, GPS-навигация, привязка к\u00A0социальным сетям, бронирование, онлайн-чат.`
  }
];

export const profession = [
  'Frontend Developer',
  'Backend Developer',
  'Fullstack Developer',
  'QA-engineer',
  'PHP Developer',
  'UI/UX Designer',
  'Android-разработчик',
  'iOS-разработчик',
  'Программист 1С-Битрикс'
];
